#1.python是什么
#  Python是面向对象的解释型高级编程语言
#  Python是强类型的动态脚本语言
#2.编写第一个程序
# print("Hello World")
# 运行py文件推荐使用方式：右键点击代码空白处，选择运行...
#3.bug
# 输入错误  注意：Python中的符号都是要用英文模式下的
# 缩进错误  注意：print顶格写，否则报错
# 语法错误  注意：两个print不可写在同一行，必须单独写一行，错误信息中遇到Syntax说明语法有问题
# 命名错误  注意：输出中文或英文类的字符串时，必须加上引号，单引号和双引号皆可
#4.debug
# 设置、取消断点:左击数字与代码间的空位即可
# debug中代码为蓝色时表示是即将要运行的代码
# show execution point  显示执行的断点
# step into 下一步
# run to cursor 跳到下一个断点的位置
print(123)
print(123)
print(123)
# 总结：可以通过debug调试看到程序执行的顺序
#5.注释
# #号注释
'''
多行注释
'''
# 多行注释就是用三引号包含，可以是三对单引号，也可是三对双引号，引号内的内容不会被程序运行
# Ctrl+/既可以添加注释，也可以取消注释，使用的是单行注释
# Ctrl+Z  撤销
# Ctrl+C  复制
# Ctrl+V  粘贴
# Ctrl+F  查找
# Ctrl+D  复制到下一行
#6.输出函数print（）
print("hahaha","ememem",sep=',')
# 输出多个值或多句话时，需要用，隔开（英文模式下）
# sep就是用来间隔多个值，默认是空格
# end 用来设定以。。。结尾，默认值是换行符\n,可以切换成其它字符串
print("hello",end=',')
print("Auzec Abendroth")
# print(字符串，end=“后面拼接的值”）  最后输出的结果：字符串+后面拼接的值+第二个print中的字符串
