#1 字符串str
# 特点： 需要加上引号，单引号和双引号都可以，包含了多行内容的时候也可以使用三引号
# name = sixstar    #报错，没有引号识别成变量名，sixstar没有被赋值
name = 'sixstar'
print(name)
print(type(name))
# 注意多行注释和用三引号的字符串类型的区别，多行注释是单独存在的，前面不需要 变量名 =

#2 格式化输出
# 2.1占位符
#  2.1.1占位符的作用：生成一定格式的字符串
#  2.1.2占位符的三种方式：
#  a） %
#   1. %s 字符串（常用）
name = 'Abendroth'
print("我的名字：%s" % name)
# 注意：占位符只是占据位置，并不会被输出
#   2. %d 整数（常用）
age = 18
name = "Abendroth"
print('我的名字：%s，年龄：%d' % (name, age))
#   3. %4d 整数
# 数字设置位数，不足前面补空白
a = 123
print('%07d' % a)  #表示输出的整数显示位数，不足的话用0补全，超出当前位数则原样输出
#   4. %f 浮点数（常用）
a = 1.23456789
print('%f' % a)
# 默认后六位小数，遵循四舍五入原则
#   5. %.4f 浮点数
# 数字设置小数位数，遵顼四舍五入原则
b = 2.34567
print('%.7f' % b)  #默认显示7位小数
#   6. %%
print('我是%%的1%%' % ())  #这是 % 格式化里的转义规则 —— 想输出一个 % 字符，就得写 %%。
#  b） f格式化
# 格式：f“{表达式}”
name = 'Abendroth'
age = 18
print(f"我的名字是{name}，我今年{age}岁了")
#  c) format()