#1.变量的作用
# 计算机中的存储空间，用于保存数据
#2.定义变量的格式
# 变量名 = 值
# 注意：=是数值运算符，左右两边打上空格是为了代码的规范性，美观性
num1 = 3   # num1就是一个变量，保存可乐的价格
num2 = 10   # num2也是一个变量，保存冰淇淋的价格
total = num1 + num2   # total也是一个变量，保存总价格
print(num1)
# 加上引号会打印引号里面的内容，没有引号就会被识别成变量名，打印的是变量的值，如果该变量没有被赋值，就会报命名错误
# 变量只有在赋值以后才会被创建，所以使用变量之前必须要赋值
a = 666
# 解释器做了两件事情
#   1.在内存中创建了一个666的数据
#   2.创建了一个变量a，把666这个数据保存到a变量中去
# b = a
# print(b)
print(a)   # 结果为666
a = 999  # 同一个变量可以反复赋值，并且可以是不同的数据类型
print(a)   # 结果为999
# python的代码是从上往下运行的
#3.标识符
# 3.1.含义：程序员定义的变量名，函数名
# 3.2.标识符规定（必须要遵守，不遵守就会报错）
#  1.只能由数字，字母，_（下划线）组成
six_ = 1
# python3可以用中文命名，但是不推荐，不符合代码的规范性
#  2.不能以数字开头
#  3.不能用关键字
# 关键字：是python中已经使用了的标识符，具有特殊的含义与功能
#  4.严格区分大小写
#4.命名规范
# 1.见名知义
# 2.下划线分割法：多个单词组成的名称，使用小写字母，单词与单词之间使用下划线分开
# 3.大驼峰命名法：多个单词组成的名称，每个单词的首字母大写，其余字母小写
# 4.小驼峰命名法：第一个单词首字母小写，后面单词首字母大写，其余字母小写
